picohari/freertos_stm32f4/src/main.c
static void NET_start (void const * arg)
{

  (void) arg;

  static ip_addr_t ipaddr;
  static ip_addr_t netmask;
  static ip_addr_t gw;

  static ip_addr_t dns;

#ifdef USE_DHCP
  ipaddr.addr = 0;
  netmask.addr = 0;
  gw.addr = 0;
#else
  /* IP address default setting */
  IP4_ADDR(&ipaddr, IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
  IP4_ADDR(&netmask, NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
  IP4_ADDR(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
#endif

  //lwip_init(); /* TODO: Check this */ 
  tcpip_init(NULL,NULL);

  /* Add the network interface */
  netif_add(&gnetif, &ipaddr, &netmask, &gw, NULL, &ethernetif_init, &tcpip_input);

  /* Registers the default network interface */
  netif_set_default(&gnetif);

  if (netif_is_link_up(&gnetif))
  {
    /* When the netif is fully configured this function must be called */
    netif_set_up(&gnetif);
  }
  else
  {
    /* When the netif link is down this function must be called */
    netif_set_down(&gnetif);
  }

  /* Start DNS service - set to ip of gateway (most routers do offer dns) */
  dns_init();
  IP4_ADDR(&dns, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
  dns_setserver(0, &dns);

#if 0
  /* Start NTP service */
  sntp_setoperatingmode(SNTP_OPMODE_POLL);
  sntp_setservername(0, "de.pool.ntp.org");
  sntp_init();
#endif

  /* Test httplog */
  //int numberone = 123;
  //httplog("led1=%d", numberone);

  /* Start HTTP service */
  osThreadDef(http, HTTP_start,    osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
  osThreadCreate( osThread(http),  NULL);

  /* Start MQTT service */
  osThreadDef(mqtt, MQTT_start,    osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 8);
  osThreadCreate( osThread(mqtt),  NULL);

  while (1) {
    osThreadTerminate( NULL );  /* important to stop task here !! */
  }

}


static void HTTP_start (void const * arg)
{

  (void) arg;

  /* Starts the httpd server */
  http_server_init();
  //http_server_socket_init();

  while(1) {

  }

}







void messageArrived(MessageData* md)
{
  MQTTMessage* message = md->message;

  writef("  Topic: %.*s\r\n", md->topicName->lenstring.len, md->topicName->lenstring.data);
  writef("Payload: %.*s\r\n", (int)message->payloadlen, (char*)message->payload);






  if (strncmp((char *) message->payload, "on", (int) message->payloadlen) == 0) {
    writef("ON\r\n");

  } else if (strncmp((char *) message->payload, "off", (int) message->payloadlen) == 0) {
    writef("OFF\r\n");
  }
}






static void MQTT_start (void const * arg)
{

  (void) arg;


  int rc = 0;
  Network n;
  Client c;
  unsigned char buf[100];
  unsigned char readbuf[100];

  ip4_addr_t broker_ipaddr;
  IP4_ADDR( &broker_ipaddr, 192, 168, 1, 101);

  //err_t err;

  mqtt_lwip_init(&n);


  rc = mqtt_lwip_connect(&n, &broker_ipaddr, 1883);

  if (rc != 0) {
    writef("Failed to connect to MQTT server\r\n");

    goto blink_to_death;
  }

  writef("Initializing MQTT service\r\n");

  MQTTClient(&c, &n, 1000, buf, 100, readbuf, 100);

  MQTTPacket_connectData data = MQTTPacket_connectData_initializer;
  
  char clientID_buf[256] = {0};

  sprintf(clientID_buf, "AL-MS-CU_%02lx%02lx%02lx%02lx%02lx%02lx", 
    (uint32_t) MAC_ADDR0, 
    (uint32_t) MAC_ADDR1, 
    (uint32_t) MAC_ADDR2, 
    (uint32_t) MAC_ADDR3, 
    (uint32_t) MAC_ADDR4, 
    (uint32_t) MAC_ADDR5);  

  data.clientID.cstring = clientID_buf;
  data.username.cstring = "admin";
  data.password.cstring = "admin";
  
  data.MQTTVersion = 3;
  data.willFlag = 0;
  data.keepAliveInterval = 5;
  data.cleansession = 1;
  
  rc = MQTTConnect(&c, &data);
  
  if (rc == MQTT_FAILURE) {
    writef("Failed to send connect request\r\n");
    goto blink_to_death;
  }

  writef("Subscribing to its topic\r\n");


  char topic_buf[256] = {0};

  sprintf(topic_buf, "%02lx:%02lx:%02lx:%02lx:%02lx:%02lx/do/#",
    (uint32_t) MAC_ADDR0, 
    (uint32_t) MAC_ADDR1, 
    (uint32_t) MAC_ADDR2, 
    (uint32_t) MAC_ADDR3, 
    (uint32_t) MAC_ADDR4, 
    (uint32_t) MAC_ADDR5); 

  rc = MQTTSubscribe(&c, topic_buf, QOS0, messageArrived);









  //rc = MQTTSubscribe(&c, "hello/world", QOS0, messageArrived);
  
  if (rc == MQTT_FAILURE) {
    writef("Failed to subscribe to its topic\r\n");
    MQTTDisconnect(&c);
    goto blink_to_death;
  }

  writef("Connected to MQTT server...\r\n");

  while(1) {
    MQTTYield(&c, 1000);
  }

  //return RDY_OK;

  blink_to_death:
  
  while(1){

  }

  //return RDY_OK;

}



















#if 1

static void GUI_start (void const * arg)
{

  (void) arg;

  /* Start µGFX */
  gfxInit();

  gdispSetBacklight(100);
  gdispSetContrast(100);

  guiCreate();

#if 1
  osThreadDef(gui, GUI_thread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
  osThreadCreate( osThread(gui), NULL);

  osDelay(100);

  osThreadDef(tty0, TTY_thread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
  osThreadCreate( osThread(tty0), NULL);
#endif

  while (1) {
    osThreadTerminate( NULL );  /* important to stop task here !! */
  }

}

static void GUI_thread (void const * arg)
{

  (void) arg;

  while (1) {
    guiEventLoop();
  }
}


#endif

















#if 1

#define BUFFER_LEN 32

#include <string.h>
#include <ctype.h>

/* Example includes. */
#include "FreeRTOS_CLI.h"

/* The CLI commands are defined in CLI-commands.c. */
void vRegisterSampleCLICommands( void );

static char input[BUFFER_LEN];
static char input_b[BUFFER_LEN];

static void TTY_thread (void const * arg)
{

  (void) arg;


  static unsigned int saved = 0;
  
  static uint8_t index = 0;
  char rx_char;

  static uint32_t printPrompt = 1;

  char *pcOutputString;
  portBASE_TYPE xReturned;

  pcOutputString = FreeRTOS_CLIGetOutputBuffer();

  /* Register two command line commands to show task stats and run time stats respectively. */
  vRegisterSampleCLICommands();

  while (1) {

    // Enable interrupt RX Not Empty Interrupt
    //__HAL_UART_ENABLE_IT(&hUART, UART_IT_RXNE);

    /* Do we have to print the prompt? */
    if(printPrompt) {
      //writef("> "); /* printf("\n"); */
      //vt100_puts("> ");
      
