picohari/freertos_stm32f4/src/main.c
      printPrompt = 0;
      memset(input, 0, sizeof(input));
    }

    int const queue_rc = xQueueReceive(rx_char_queue, &rx_char, portMAX_DELAY);
    if (queue_rc == pdFALSE) {
        index = 0;
        continue; // Try again
    }

    // Process

    /* Check for simple line control characters */
    if(((rx_char == 010) || (rx_char == 0x7f)) && index) {
      /* User pressed backspace */
      writef("\010 \010");        /* Obliterate character */
      //vt100_putc('\b');
      index--;                    /* Then keep track of how many are left */
      input[index] = '\0';        /* Then remove it from the buffer */

    } else if(rx_char == '!') {   /* '!' repeats the last command */
      if(saved) {                 /* But only if we have something saved */
        strcpy(input, input_b);   /* Restore the command */
        //writef("HIS: %s",input);
        index = strlen(input);
        goto parseme;
      }
    } else if(isprint((unsigned int) rx_char)) {
      /* We are only going to save printable characters */
      if(index >= sizeof(input)) {

        /* We are out of space */
        writef("\x07");   /* Beep */
        continue;         /* TODO: Check this!*/

      } else {
        /* Store char in buffer */
        input[index] = rx_char;
        index++;
        /* Echo it back to the user */
        writef("%c", rx_char);
        //vt100_putc(rx_char);
      }
    } else if(rx_char == 0x1b) { /* ESC Key - forward to terminal only */
        //vt100_putc(rx_char);

    } else if(rx_char == '\r') {
      /* NULL Terminate anything we have received */
      input[index] = '\0';
      /* save current buffer in case we want to re-do the command */
      strcpy(input_b, input);
      saved = 1;

      /* The user pressed enter, parse the command */
    
    parseme:
      /* Send CR to console */
      writef("\r\n");
      //vt100_putc('\r'); 
      index = 0;
      
      #if 1
      do {
        xReturned = FreeRTOS_CLIProcessCommand( input, pcOutputString, configCOMMAND_INT_MAX_OUTPUT_SIZE );
        writef("%s", pcOutputString);
        //vt100_puts(pcOutputString);

      } while( xReturned != pdFALSE );

      //vt100_putc('\r');
      #endif

      printPrompt = 1;
    }

    /* We have a character to process */
    //writef("got:'%c' %d %d \r\n", c, c, count);

  }

}



#endif



































#if 0


#include <time.h>
#include <sys/time.h>

#include <locale.h>

#define TIMEBUF   64

static void RTC_thread (void const * arg)
{

  (void) arg;

  struct tm tm_set;

  /* Set time to 1.1.2017 00:00 */

  tm_set.tm_sec  = 1;         /* seconds,  range 0 to 59          */
  tm_set.tm_min  = 0;         /* minutes, range 0 to 59           */
  tm_set.tm_hour = 0;         /* hours, range 0 to 23             */

  tm_set.tm_mon  = 0;             /* month, range 0 to 11             */
  tm_set.tm_year = 2017 - 1900;   /* The number of years since 1900   */
  tm_set.tm_mday = 1;             /* day of the month, range 1 to 31  */
  tm_set.tm_isdst = -1;           /* daylight saving time             */

#if 0
  /*
  The mktime function ignores the specified contents of the tm_wday and tm_yday members of the broken-down
  time structure. It uses the values of the other components to compute the calendar time; it's permissible
  for these components to have unnormalized values outside of their normal ranges. The last thing that mktime 
  does is adjust the components of the brokentime structure (including the tm_wday and tm_yday).
  */ 
  tm_set.tm_yday;        /* day in the year, range 0 to 365  */
  tm_set.tm_wday;        /* day of the week, range 0 to 6    */

  //debug("Size of time_t: %d\n", sizeof(time_t)); /* Returns: 4 = 32bit => we have a year 2038 Problem... */
#endif

  /* Create time from settings provided in tm_set */
  time_t set_timer = mktime(&tm_set) ;

  //debug("%lu \n", set_timer );  // Print timestamp

  /* Set system time to milliseconds, reduce by one second */
  clock_timestamp = (uint64_t) set_timer * 1000U;

  //setlocale(LC_TIME, "de_DE.UTF-8");

  while (1) {

    static char buffer[TIMEBUF];
    
    static time_t timer;
    static struct tm* tm_info;

    static char buffer_del[TIMEBUF];
    static struct tm tm_del;

/*
       1  2  3  4  5  6  7
rtc    mo di mi do fr sa so

    0  1  2  3  4  5  6
lib so mo di mi do fr sa
*/

    /* Read time info from clock (UTC) via _gettimeofday() */
    time(&timer);

    /* Break up time info as local time */
    tm_info = localtime(&timer);
    
#if 0
    //taskENTER_CRITICAL();

    strftime (buffer, TIMEBUF, "%a, %d. %B %Y\n", tm_info); /* So, 31. Januar 1970 */
    gdispFillStringBox( 5, 60, 200, 20, buffer, dejavu_sans_10, White, Black, justifyLeft);
    memset(buffer, 0, TIMEBUF);
    //gfxSleepMilliseconds(50);

    strftime (buffer, TIMEBUF, "%H:%M:%S TZ: %Z\n", tm_info);
    gdispFillStringBox( 5, 80, 200, 20, buffer, dejavu_sans_10, White, Black, justifyLeft);
    memset(buffer, 0, TIMEBUF);
    //gfxSleepMilliseconds(50);
#endif


#if 0
    // compare/store old value
    if (tm_del.tm_sec != tm_info->tm_sec) {

      do {
        /* Delete old value from screen */
        sprintf(buffer_del, "%s\n", asctime(&tm_del));
        gdispDrawString( 5, 40, buffer_del, dejavu_sans_16, Black);
        
        /* Draw new value */
        sprintf(buffer, "%s\n", asctime(tm_info));
        gdispDrawString( 5, 40, buffer, dejavu_sans_16, White);
        
        /* store new value as old one.. */
        tm_del = *tm_info;

      } while (0);

    }

    sprintf(buffer, "DST: %d DOW: %d DOY: %d \n", tm_info->tm_isdst, tm_info->tm_wday, tm_info->tm_yday);
    gdispFillStringBox( 5, 100, 200, 20, buffer, dejavu_sans_10, White, Black, justifyLeft);
    memset(buffer, 0, TIMEBUF);
    //gfxSleepMilliseconds(50);

#endif
    //taskEXIT_CRITICAL();

    /*
    vt100_puts("\e[H");
    vt100_puts(aShowTime); vt100_putc('\r');
    vt100_puts(aShowDate); vt100_putc('\r');
    */

    osDelay(10);
  }

