picohari/freertos_stm32f4/src/main.c
}



#endif











static void LED1_thread (void const * arg)
{

  (void) arg;

  while(1) {
    BSP_LED_On(LED1);
    osDelay(LED1_UPDATE_DELAY);
    BSP_LED_Off(LED1);
    osDelay(LED1_UPDATE_DELAY);
  }
}


static void LED2_thread (void const * arg)
{

  (void) arg;

  while(1) {
    BSP_LED_On(LED2);
    osDelay(LED2_UPDATE_DELAY);
    BSP_LED_Off(LED2);
    osDelay(LED2_UPDATE_DELAY);
  }
}





















static void Register_printout(void)
{

    /* Put some information on the starting screen */
  writef("\033[2J"); // Clear screen
  writef("\r\n");

  /* Read some Hardware Registers for information and fun ;) */
  char rev_id[42];
  sprintf((char*)rev_id,  "XCore: 0x%04lx, Rev. 0x%04lx", (DBGMCU->IDCODE & 0x00000FFF), ((DBGMCU->IDCODE >> 16) & 0x0000FFFF));
  writef("%s", rev_id);
  writef("\r\n");
  /*
     * \par Revisions possible:
     *  - 0x1000: Revision A
     *  - 0x1001: Revision Z
     *  - 0x1003: Revision Y
     *  - 0x1007: Revision 1
     *  - 0x2001: Revision 3
     *
     * \par Device signatures:
     *  - 0x0413: STM32F405xx/07xx and STM32F415xx/17xx)
     *  - 0x0419: STM32F42xxx and STM32F43xxx
     *  - 0x0423: STM32F401xB/C
     *  - 0x0433: STM32F401xD/E
     *  - 0x0431: STM32F411xC/E
     *  - 0x0421: STM32F446xx
     *  - 0x0449: STM32F7x6xx
     *  - 0x0444: STM32F03xxx
     *  - 0x0445: STM32F04xxx
     *  - 0x0440: STM32F05xxx
     *  - 0x0448: STM32F07xxx
     *  - 0x0442: STM32F09xxx
  */

  /* Read UUID */
  uint32_t idPart1 = STM32_UUID[0];
  uint32_t idPart2 = STM32_UUID[1];
  uint32_t idPart3 = STM32_UUID[2];
  char  uuid0_tmp[32];
  sprintf((char*)uuid0_tmp,  "UUID:  %08lx-%08lx-%08lx", idPart1, idPart2, idPart3);
  writef("%s", uuid0_tmp);
  writef("\r\n");

  /* Print flash size */
  uint32_t flashSize = STM32_UUID_FLASH[0];
  char flash_tmp[32];
  sprintf((char*)flash_tmp, "%lx", flashSize);

  char flash[6];
  sprintf ((char*)flash, &(flash_tmp[strlen(flash_tmp) - 4]));

  uint16_t size = strtol((char*)flash, NULL, 16);
  sprintf((char*)flash_tmp, "Flash: %d kB", size);
  writef("%s", flash_tmp);
  writef("\r\n");

  /* Print package code (hardware chip case form) */
  uint32_t flashPack = (((*(__IO uint16_t *) (STM32_UUID_PACK)) & 0x0700) >> 8);
  /*
   *  - 0b01xx: LQFP208 and TFBGA216 package
   *  - 0b0011: LQFP176 and UFBGA176 package
   *  - 0b0010: WLCSP143 and LQFP144 package
   *  - 0b0001: LQFP100 package
   */
  uint8_t pack_tmp[10];
  sprintf((char*)pack_tmp,  "Pack:  %lx", flashPack);
  writef("%s", pack_tmp);
  writef("\r\n");

  /* System clock runnning at ... */
  writef("CLK:   %d MHz", SystemCoreClock / 1000000UL);
  writef("\r\n");

  /* We run our code as ... */
  writef("Firmware %s", VERSION_STRING_LONG);
  writef("\r\n");

  /* Welcome to our guests ;) */
  writef("CMSIS - FreeRTOS - LwIP - BSP - uGFX");
  writef("\r\n");
  writef("\r\n");

  /* NAND flash drive */
  flashdrive_init();

  static NAND_IDTypeDef flash_id;

  HAL_NAND_Read_ID(&hNAND, &flash_id);

  writef("NAND Flash ID = 0x%02x, 0x%02x, 0x%02x, 0x%02x\r\n", flash_id.Maker_Id, flash_id.Device_Id,
                                                               flash_id.Third_Id, flash_id.Fourth_Id );

  if ((flash_id.Maker_Id == 0xEC) && (flash_id.Device_Id == 0xF1)
    && (flash_id.Third_Id == 0x80) && (flash_id.Fourth_Id == 0x15))
  {
   writef("Type = K9F1G08U0A\r\n");
  }
  else if ((flash_id.Maker_Id == 0xEC) && (flash_id.Device_Id == 0xF1)
    && (flash_id.Third_Id == 0x00) && (flash_id.Fourth_Id == 0x95))
  {
   writef("Type = K9F1G08U0B\r\n");   
  }
  else if ((flash_id.Maker_Id == 0xAD) && (flash_id.Device_Id == 0xF1)
    && (flash_id.Third_Id == 0x80) && (flash_id.Fourth_Id == 0x1D))
  {
   writef("Type = HY27UF081G2A\r\n");   
  }
  else
  {
   writef("Type = Unknow\r\n");
  }
  writef("\r\n");

}


/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 168000000
  *            HCLK(Hz)                       = 168000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 336
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler();
  }
  
  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;  
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    /* Initialization Error */
    Error_Handler();
  }

  /* STM32F405x/407x/415x/417x Revision Z devices: prefetch is supported  */
  if (HAL_GetREVID() == 0x1001)
  {
    /* Enable the Flash prefetch */
    __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
  }
}


/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* User may add here some code to deal with this error */
  while(1)
  {
  }
}


#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

